**Pandas** is a Python library containing a set of functions and specialised data structures that have been designed to help Python programmers to perform data analysis tasks in a structured way.

Most of the things that pandas can do can be done with basic Python, but the collected set of pandas functions and data structure makes the data analysis tasks more consistent in terms of syntax and therefore aids readabilty.

## Importing the pandas library

Importing the pandas library is done in exactly the same way as for any other library. In almost all examples of Python code using the pandas library, it will have been imported and given an alias of pd. We will follow the same convention.

In [1]:
import numpy as np
import pandas as pd

## Pandas data structures
There are two main data structure used by pandas, they are the **Series** and the **Dataframe**. 

The **Series** equates in general to a vector or a list. 
The **Dataframe** is equivalent to a table. Each column in a pandas Dataframe is a pandas Series data structure.

## Object creation

Creating a **Series** by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Creating a DataFrame by passing a NumPy array, 
# with a datetime index  using date_range() and labeled columns:
dates = pd.date_range("20130101", periods=6)
dates
# Six-by-four array of samples from the normal distribution
df = pd.DataFrame(np.random.randn(6, 4), index=dates, 
                  columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.094594  1.208617  0.140755  2.618775
2013-01-02  0.057474  0.292012  0.337272 -0.900359
2013-01-03 -0.822275  0.604665 -0.117944  0.210178
2013-01-04 -0.856133  0.107649  0.721308  0.312239
2013-01-05  0.342847  0.619006  0.107858 -0.296865
2013-01-06  0.743549  1.509354 -0.174038  0.755036

In [4]:
df2 = pd.DataFrame(
        {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
        }
    ) 
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
# The columns of the resulting DataFrame have different dtypes:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data

Use **DataFrame.head()** and **DataFrame.tail()** to view the top and bottom rows of the frame respectively

In [5]:
df.head()

                   A         B         C         D
2013-01-01 -1.094594  1.208617  0.140755  2.618775
2013-01-02  0.057474  0.292012  0.337272 -0.900359
2013-01-03 -0.822275  0.604665 -0.117944  0.210178
2013-01-04 -0.856133  0.107649  0.721308  0.312239
2013-01-05  0.342847  0.619006  0.107858 -0.296865

In [6]:
df.tail()

                   A         B         C         D
2013-01-02  0.057474  0.292012  0.337272 -0.900359
2013-01-03 -0.822275  0.604665 -0.117944  0.210178
2013-01-04 -0.856133  0.107649  0.721308  0.312239
2013-01-05  0.342847  0.619006  0.107858 -0.296865
2013-01-06  0.743549  1.509354 -0.174038  0.755036

Display the **DataFrame.index** or **DataFrame.columns**

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [10]:
# How many rows?
print(len(df))

6

In [11]:
# How many rows and columns?
print(df.shape)

(6, 4)

In [13]:
#How many 'cells' in the table
print(df.size)

24

In [14]:
# What are the column names
print(df.columns)

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
# what are the data types of the columns?
print(df.dtypes)

A    float64
B    float64
C    float64
D    float64
dtype: object

## Selection

While standard Python / NumPy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods.

In [21]:
# Selecting a single column, which yields a Series, 
# equivalent to df.A:
df["A"]

2013-01-01   -2.133730
2013-01-02    0.360550
2013-01-03    0.245500
2013-01-04   -1.042187
2013-01-05    1.418475
2013-01-06   -0.883338
Freq: D, Name: A, dtype: float64

In [22]:
# Selecting slices of the rows
df[0:3]

                  A         B         C         D
2013-01-01 -2.13373  1.933823 -1.537224  0.866213
2013-01-02  0.36055 -0.064826  0.678434 -0.753787
2013-01-03  0.24550  0.897406  0.693041  0.127633

In [23]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.360550 -0.064826  0.678434 -0.753787
2013-01-03  0.245500  0.897406  0.693041  0.127633
2013-01-04 -1.042187  3.140443 -1.485723 -0.541054

## Boolean indexing

Using a single column’s values to select data:

In [24]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.360550 -0.064826  0.678434 -0.753787
2013-01-03  0.245500  0.897406  0.693041  0.127633
2013-01-05  1.418475  0.147840 -0.194656 -0.195596

Selecting values from a DataFrame where a boolean condition is met

In [25]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.933823       NaN  0.866213
2013-01-02  0.360550       NaN  0.678434       NaN
2013-01-03  0.245500  0.897406  0.693041  0.127633
2013-01-04       NaN  3.140443       NaN       NaN
2013-01-05  1.418475  0.147840       NaN       NaN
2013-01-06       NaN  0.923149  0.720451       NaN

## Reading a csv file

csv files are read as complete datasets in pandas. You do not have to explicitly open and close the dataset. All of the dataset records are assembled into a Dataframe. 

If your dataset has column headers in the first record then these can be used as the Dataframe column names. You can explicitly state this in the parameters to the call, but pandas is usually able to infer that there ia a header row and use it automatically.

We are going to read in our SN7577.txt file. We will use the pandas **read_csv** method, but we will explicitly tell the method that the separator is the **tab** character and not a **comma** which is the default.

In [28]:
df_SN7577 = pd.read_csv("SN7577.txt", sep='\t')

In [29]:
# Display the top columns
df_SN7577.head()

,Q1,Q2,Q3,Q4,Q5ai,Q5aii,Q5aiii,Q5aiv,Q5av,Q5avi,...,numhhd,numkid,numkid2,numkid31,numkid32,numkid33,numkid34,numkid35,numkid36,wts
0,1,-1,1,8,0,0,0,1,0,0,...,3,11,2,0,0,0,0,1,0,1.11439
1,3,-1,1,4,0,0,0,0,0,0,...,3,11,2,0,0,0,0,1,0,2.56604
2,10,3,2,6,0,0,0,0,0,0,...,2,11,2,0,0,0,0,1,0,2.04468
3,9,-1,10,10,0,0,0,0,0,0,...,1,-1,2,0,0,0,0,1,0,1.07592
4,10,2,6,1,0,0,0,1,0,0,...,1,-1,2,0,0,0,0,1,0,1.25068

In [30]:
# How many rows?
print(len(df_SN7577))

1286

In [31]:
# How many rows and columns - returned as a tuple
print(df_SN7577.shape)

(1286, 202)

In [32]:
#How many 'cells' in the table
print(df_SN7577.size)

259772

In [33]:
# What are the column names
print(df_SN7577.columns)

Index(['Q1', 'Q2', 'Q3', 'Q4', 'Q5ai', 'Q5aii', 'Q5aiii', 'Q5aiv', 'Q5av',
       'Q5avi',
       ...
       'numhhd', 'numkid', 'numkid2', 'numkid31', 'numkid32', 'numkid33',
       'numkid34', 'numkid35', 'numkid36', 'wts'],
      dtype='object', length=202)

In [34]:
# what are the data types of the columns?
print(df_SN7577.dtypes)

Q1            int64
Q2            int64
Q3            int64
Q4            int64
Q5ai          int64
             ...
numkid33      int64
numkid34      int64
numkid35      int64
numkid36      int64
wts         float64
Length: 202, dtype: object